# Trystan2k's Brewfile

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "cantino/mcfly"
tap "espanso/espanso"

# Binaries
brew "ack"
brew "coreutils"
brew "asdf"
brew "autojump"
brew "bat"
brew "curl"
brew "detox"
brew "exa"
brew "fd"
brew "fx"
brew "fzf"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "gum"
brew "httpie"
brew "hub"
brew "jq"
brew "m-cli"
brew "mcfly"
brew "pass"
brew "procs"
brew "ripgrep"
brew "scrcpy"
brew "shellcheck"
brew "subversion"
brew "terminal-notifier"
brew "tree"
brew "wget"
brew "zsh"

# Apps

## Utils
cask "alt-tab"
cask "android-file-transfer"
cask "android-platform-tools"
cask "appcleaner"
cask "around"
cask "caffeine"
cask "espanso"
cask "hot"
cask "hiddenbar"
cask "lulu"
cask "meetingbar"
cask "notion"
cask "overkill"
cask "raycast"
cask "shottr"
cask "unclack"

## Dev
cask "figma"
cask "hyper"
cask "postman"

## Browsers
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"

## Multimedia
cask "LosslessCut"
cask "blackhole-16ch"

## Editors
cask "sublime-text"
cask "visual-studio-code"

# Fonts
cask "font-fira-code"
cask "font-hack-nerd-font"
