# Personal File


## Binaries
brew "mas"
brew "youtube-dl"

## Utils
cask "daisydisk"
cask "duplicati"
cask "parallels"
cask "pock"
cask "slack"
cask "transmission"
cask "vidrio"

# Dev
cask "docker"

## Multimedia
cask "iina"
cask "stremio"

## Editors
cask "pdf-expert"

# App Store
mas "Friendly Streaming", id: 553245401
mas "HP Smart", id: 1474276998
mas "Picsee", id: 1454805783
