# Trystan2k's Brewfile

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "cantino/mcfly"

# Binaries
brew "ack"
brew "coreutils"
brew "asdf"
brew "autojump"
brew "bat"
brew "curl"
brew "detox"
brew "exa"
brew "fd"
brew "fx"
brew "fzf"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "httpie"
brew "hub"
brew "jq"
brew "mas"
cask "mcfly"
brew "pass"
brew "ripgrep"
brew "scrcpy"
brew "shellcheck"
brew "subversion"
brew "terminal-notifier"
brew "tree"
brew "wget"
brew "youtube-dl"
brew "zsh"

# Apps

## Utils
cask "android-file-transfer"
cask "android-platform-tools"
cask "appcleaner"
cask "caffeine"
cask "daisydisk"
cask "duplicati"
cask "fanny"
cask "hiddenbar"
cask "licecap"
cask "meetingbar"
cask "notion"
cask "overkill"
cask "parallels"
cask "pock"
cask "raycast"
cask "slack"
cask "transmission"
cask "vidrio"

## Dev
cask "docker"
cask "hyper"
cask "postman"

## Browsers
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"

## Chats
cask "pdf-expert"

## Movies
cask "iina"
cask "stremio"

## Editors
cask "sublime-text"
cask "visual-studio-code"

# Fonts
cask "font-fira-code"
cask "font-hack-nerd-font"

# App Store
mas "Friendly Streaming", id: 553245401
mas "HP Smart", id: 1474276998